using System;


class Program
{
    static void Main()
    {    /*Напишете програма, която прилага бонус точки към дадени точки в интервала [1..9] чрез прилагане на следните правила:
        - Ако точките са между 1 и 3, програмата ги умножава по 10.
        - Ако точките са между 4 и 6, програмата ги умножава по 100.
        - Ако точките са между 7 и 9, програмата ги умножава по 1000.
        - Ако точките са 0 или повече от 9, се отпечатва съобщение за грешка.*/

        Console.Write("Въведете цифра от 1 до 9: ");
        byte num = Convert.ToByte(Console.ReadLine());
        if (num >= 1 && num <= 3)
            Console.WriteLine("Число, умножено по 10: {0}", num * 10);
        else if (num >= 4 && num <= 6)
            Console.WriteLine("Число, умножено по 100: {0}", num * 100);
        else if (num >= 7 && num <= 9)
            Console.WriteLine("Число, умножено по 1000: {0}", num * 1000);
        else
            Console.WriteLine("Неправилно въведено число!");
            Console.ReadLine();
    }
}

